app/controllers/seed_controller.rb

  def product
    @title="Seed Product"
    @seeds = Seed.all
---
SELECT "seeds".* FROM "seeds"